{
  "education": [
    {
      "awards_achievements": [
        "Workshops and Innovations Lead of NeuroTechUofT - Summer 2019",
        "Member of UofT Public Speaking Club - 2018/2019"
      ],
      "degree": "Honours Bachelor of Science",
      "department": "Neuroscience and Cell Biology",
      "duration": "2015-2020",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AhmedAmer",
  "highlighted_projects": [
    {
      "description": "Developed a web app with React.js/JavaScript/CSS. Provisioned the use of React Router for the navigation layout. Created root CSS variables for efficient styling. Created React components such as an animated background hero, navbar, cards, and footer from scratch.",
      "git_url": "",
      "name": "React Website"
    },
    {
      "description": "Developed a simple, functional React web app for listing daily tasks and checking them off when they are completed. Wrote logic code in TypeScript for functions that implemented the add, delete, modify, and check off buttons. Created React component for real-time clock that updates each second.",
      "git_url": "",
      "name": "React Daily Tasks App"
    },
    {
      "description": "Created simple HTML/Tailwind landing page. Ensured responsive design for all components and elements of the page. This project was meant as a simple learning tool for Tailwind CSS.",
      "git_url": "",
      "name": "Website Landing Page"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed and implemented a series of bash scripts that would monitor the usage data of a network of Linux machines and store that data within a relational database (PostGreSQL). Wrote a bash script to collect each terminal's usage data in intervals using the Linux shell and crontab. Developed script to automate connecting to PostGreSQL database and inserting data. Also developed script for the automation of starting/stopping the PostGreSQL docker. The scripts were built and tested through a Rocky Linux 9 VM provisioned through the Google Cloud Platform.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Grep App: Designed and implemented a Java application that mimics the Linux CLI grep command - effectively searches for string matches in a file directory and returns the lines associated with the pattern. App was implemented using the core Java util as well as Java nio library and Java Stream api. The app was developed, built, compiled, and packaged using Maven and a Docker image was built and distributed on Docker hub. Testing with JUnit occurred when implementing a method for matching regex expressions to strings.",
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Ahmed Amer",
  "others": [
    {
      "bullets": [
        "Data Science with Python - DataCamp (March 2022)",
        "Java Algorithms - LinkedIn (April 2024)",
        "Agile Software Development: Clean Code Practices - LinkedIn (November 2023)",
        "JavaScript Deep Dive - Scrimba (February 2024)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Rec League Basketball",
        "Professional Musician - Live performances and studio recordings"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Attended agile scrum meetings daily. Worked as part of a team of developers to write Linux bash scripts that monitored memory usage within a network of Linux machines. Wrote scripts that stored that data in a PostGreSQL database in intervals of one minute.",
      "duration": "Sep 2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Kambira",
      "description": "Worked hand-in-hand with the founding developers of the company to propel their vision forward as a member of a team. Built the front-end portion of the React.js web app using Tailwind/TypeScript according to designs conceptualized beforehand on Figma. Adjusted and added to designs of over 10 different pages of the app using Figma. Finished coding logic for and styling over 10 pages of the web app, including buttons, alert messages, user information, and dropdown menus.",
      "duration": "Dec 2023-May 2024",
      "title": "Software Developer"
    },
    {
      "company": "Top Offer",
      "description": "Edited the spelling, grammar, and contents of over 300 professional letters, emails, and applications to graduate programs across the country for international students. Communicated with cross-functional teams in order to ensure client needs were met on a timely basis. Met extreme deadlines in cases where last minute edits were requested.",
      "duration": "Nov 2020-Apr 2021",
      "title": "Application Editor"
    }
  ],
  "skills": {
    "competent": [
      "TypeScript",
      "Agile Software Development",
      "Data Scraping/Cleaning",
      "Data Structures and Algorithms",
      "Linux Terminal/Bash Scripts",
      "RDBMS/SQL Systems"
    ],
    "familiar": [
      "PostGreSQL",
      "ML Supervised/Unsupervised Learning",
      "Tableau/Power BI",
      "C#",
      "Spring Boot"
    ],
    "proficient": [
      "Java",
      "Python",
      "React.js",
      "HTML/CSS",
      "SQL Queries",
      "JavaScript"
    ]
  },
  "summary": "I am a self-taught programmer with over 40 certificates in Web Development, Object-oriented Programming, Data Science, and Algorithms. After graduating from one of the most challenging programs at the University of Toronto, I decided to switch careers and pursue my true passion; coding. Throughout my learning journey, I realised the world of coding did not just challenge the growth of my technical skills, it also empowered the manifestation of my creative visions. The result was numerous solo projects and my involvement in building a novel finance-based mobile web app; my first experience as a developer within a team. The combination of my formal education and my single-handed pursuit of programming has helped me develop an ability to think both creatively and critically. Through my achievements thus far, I have also showcased a talent for absorbing complex knowledge in a short amount of time. I feel confident and excited knowing what lies ahead for me within the realms of software development."
}
